// ============================================================
// SEÇÃO 1 — CABEÇALHO / MENU
// Responsável: (Thiago)
// ============================================================
const btnToggle = document.getElementById('menu-btnToggle')
const menuNavegacao = document.getElementById('menuNavegacao')

btnToggle.addEventListener('click', () => {
    const aberto = menuNavegacao.classList.toggle('aberto')
    btnToggle.setAttribute('arial-expanded', aberto)
    btnToggle.textContent = aberto ? '✕' : '☰'
})

// ============================================================
// SEÇÃO 2 — HOME
// Responsável: (Vitor Moret)
// ============================================================


// ============================================================
// SEÇÃO 3 — SOBRE A DELICUP
// Responsável: (Vitor Ferrer)
// ============================================================


// ============================================================
// SEÇÃO 4 — PRODUTOS
// Responsável: (Vitória)
// ============================================================


// ============================================================
// SEÇÃO 5 — DIFERENCIAIS
// Responsável: (Fernando)
// ============================================================


// ============================================================
// SEÇÃO 6 — NOSSA HISTÓRIA
// Responsável: (João Morais)
// ============================================================


// ============================================================
// SEÇÃO 7 — MISSÃO, VISÃO E VALORES
// Responsável: (João Paulo)
// ============================================================


// ============================================================
// SEÇÃO 8 — EQUIPE
// Responsável: (Cauã)
// ============================================================


// ============================================================
// SEÇÃO 9 — CONTATO / LOCALIZAÇÃO
// Responsável: (Thiago)
// ============================================================


// ============================================================
// SEÇÃO 10 — RODAPÉ (FOOTER)
// Responsável: (Thiago))
// ============================================================